In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('income.csv',names=["name","income"], skiprows=[0])
df

     name    income
0     Rob      5000
1     Ram      6000
2   Bheem      4000
3     Tao      7500
4  Sophia      8000
5    Musk      7000
6    Nina  10000000

In [5]:
df.income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [6]:
df.income.quantile(0)  #Quantiles are typically specified as a decimal between 0 and 1.

4000.0

In [7]:
df.income.quantile(0.25,interpolation="higher")

6000

In [8]:
#using quantiles to remove outliers
percentile_99=df.income.quantile(0.99)   #we discard anything which is more than 99 quantile
percentile_99

9400479.999999994

In [9]:
df_no_outlier = df[df.income<=percentile_99]
df_no_outlier

     name  income
0     Rob    5000
1     Ram    6000
2   Bheem    4000
3     Tao    7500
4  Sophia    8000
5    Musk    7000

In [10]:
df_outlier = df[df.income>percentile_99] 
df_outlier

   name    income
6  Nina  10000000

# filling missing value

In [12]:
df['income'][3]=np.NaN  #we have made row 3 as NAn
df

     name      income
0     Rob      5000.0
1     Ram      6000.0
2   Bheem      4000.0
3     Tao         NaN
4  Sophia      8000.0
5    Musk      7000.0
6    Nina  10000000.0

In [13]:
df.income.mean()

1671666.6666666667

In [14]:
df_new = df.fillna(df.income.mean())
df_new

     name        income
0     Rob  5.000000e+03
1     Ram  6.000000e+03
2   Bheem  4.000000e+03
3     Tao  1.671667e+06
4  Sophia  8.000000e+03
5    Musk  7.000000e+03
6    Nina  1.000000e+07

In [15]:
df_new = df.fillna(df.income.median())
df_new

     name      income
0     Rob      5000.0
1     Ram      6000.0
2   Bheem      4000.0
3     Tao      6500.0
4  Sophia      8000.0
5    Musk      7000.0
6    Nina  10000000.0